In [1]:
import pandas as pd
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/AirPassengers-1eaa575774ad408691e22a1edfcab2ec.csv')

In [2]:
df.head()

     Month  Passengers
0  1949-01         112
1  1949-02         118
2  1949-03         132
3  1949-04         129
4  1949-05         121

In [23]:
df["Year"]=df.Month.apply(lambda x: x.split("-")[0])

In [24]:
df.head()

     Month  Passengers  Year
0  1949-01         112  1949
1  1949-02         118  1949
2  1949-03         132  1949
3  1949-04         129  1949
4  1949-05         121  1949

In [27]:
result=df.groupby("Year")["Passengers"].mean()

In [28]:
result

Year
1949    126.666667
1950    139.666667
1951    170.166667
1952    197.000000
1953    225.000000
1954    238.916667
1955    284.000000
1956    328.250000
1957    368.416667
1958    381.000000
1959    428.333333
1960    476.166667
Name: Passengers, dtype: float64

In [29]:
mean_passengers_by_year=pd.Series(result)

In [30]:
mean_passengers_by_year["1950"]

np.float64(139.66666666666666)

In [35]:
import pandas as pd
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/AirPassengers-1eaa575774ad408691e22a1edfcab2ec.csv')

# Code here
df["Year"]=df.Month.apply(lambda x: int(x.split("-")[0]))
result=df.groupby("Year")["Passengers"].mean()
mean_passengers_by_year=pd.Series(result)
# Input and output processing (do not edit)
mean_passengers_by_year = mean_passengers_by_year.round(0).astype(int)
print(mean_passengers_by_year.loc[int(input())])

 1950

140

In [36]:
import pandas as pd
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/active_grandmasters_March25-b0e7a64fd25c48ab8f380debb40e8a0a.csv')
df.head()

   ID Number              Name  Fed Sex Tit WTit OTit  Rating  Gms  B-day
0    1503014   Carlsen, Magnus  NOR   M  GM  NaN  NaN    2833    0   1990
1    2016192  Nakamura, Hikaru  USA   M  GM  NaN  NaN    2802    0   1987
2   46616543          Gukesh D  IND   M  GM  NaN  NaN    2787   13   2006
3    2020009  Caruana, Fabiano  USA   M  GM  NaN  NaN    2783   13   1992
4   35009192    Erigaisi Arjun  IND   M  GM  NaN  NaN    2777   13   2003

In [48]:
res=df.groupby("Fed")["Rating"].mean()
res["USA"]

np.float64(2510.0149253731342)

In [44]:
df["avg"]=df["Fed"].map(res)

In [56]:
df.head()

,ID Number,Name,Fed,Sex,Tit,WTit,OTit,Rating,Gms,B-day,avg
0,1503014,"Carlsen, Magnus",NOR,M,GM,NaN,NaN,2833,0,1990,2504.937500
1,2016192,"Nakamura, Hikaru",USA,M,GM,NaN,NaN,2802,0,1987,2510.014925
2,46616543,Gukesh D,IND,M,GM,NaN,NaN,2787,13,2006,2523.338235
3,2020009,"Caruana, Fabiano",USA,M,GM,NaN,NaN,2783,13,1992,2510.014925
4,35009192,Erigaisi Arjun,IND,M,GM,NaN,NaN,2777,13,2003,2523.338235

In [54]:
new_df=df[df["Rating"]>=df["avg"]]

In [57]:
new_df.head()

,ID Number,Name,Fed,Sex,Tit,WTit,OTit,Rating,Gms,B-day,avg
0,1503014,"Carlsen, Magnus",NOR,M,GM,NaN,NaN,2833,0,1990,2504.937500
1,2016192,"Nakamura, Hikaru",USA,M,GM,NaN,NaN,2802,0,1987,2510.014925
2,46616543,Gukesh D,IND,M,GM,NaN,NaN,2787,13,2006,2523.338235
3,2020009,"Caruana, Fabiano",USA,M,GM,NaN,NaN,2783,13,1992,2510.014925
4,35009192,Erigaisi Arjun,IND,M,GM,NaN,NaN,2777,13,2003,2523.338235

In [69]:
x=new_df.groupby("Fed")["Name"].apply(list)

In [70]:
x.head()

Fed
ALG                                  [Bellahcene, Bilel]
AND                      [Henderson de La Fuente, Lance]
ARG    [Mareco, Sandro, Peralta, Fernando, Felgaer, R...
ARM    [Sargsyan, Shant, Martirosyan, Haik M., Melkum...
AUS       [Cheng, Bobby, Kuybokarov, Temur, Tan, Justin]
Name: Name, dtype: object

In [71]:
filename='https://d3ejq4mxgimsmf.cloudfront.net/Product_sales_data-9f83ae7a11c340d1884ae214aadbacac.csv'

In [72]:
df=pd.read_csv(filename)

In [73]:
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/athletes_dataset-bbcc67f2702d42babc76a9d519c9d131.csv')

In [74]:
df.head()

           Name  Age      Sport
0    Ravi Kumar   34     Tennis
1   Sneha Reddy   33   Swimming
2  Anjali Mehta   32  Athletics
3  Vikram Joshi   31   Swimming
4  Kiran Sharma   30     Tennis

In [78]:
x=df.groupby("Sport")["Age"].median()

In [80]:
df["median"]=df["Sport"].map(x)

In [82]:
df.head()

           Name  Age      Sport  median
0    Ravi Kumar   34     Tennis    19.5
1   Sneha Reddy   33   Swimming    19.0
2  Anjali Mehta   32  Athletics    18.5
3  Vikram Joshi   31   Swimming    19.0
4  Kiran Sharma   30     Tennis    19.5

In [83]:
new_df=df[df["Age"]<=df["median"]]

In [84]:
new_df.head()

             Name  Age      Sport  median
21    Simran Kaur   19     Tennis    19.5
23  Aditya Pillai   19   Swimming    19.0
25     Rahul Nair   18  Athletics    18.5
26     Shruti Rao   18   Swimming    19.0
28    Tanya Singh   17     Tennis    19.5

In [85]:
res=new_df.groupby("Sport")["Name"].apply(list)

In [86]:
res.head()

Sport
Athletics     [Rahul Nair, Mohit Agarwal, Aarav Kapoor, Sanj...
Gymnastics    [Bhavna Shah, Nisha Dutta, Devika Rani, Tarun ...
Swimming      [Aditya Pillai, Shruti Rao, Kunal Deshmukh, Ya...
Tennis        [Simran Kaur, Tanya Singh, Rekha Sinha, Lakshm...
Name: Name, dtype: object

In [87]:
filename = 'https://d3ejq4mxgimsmf.cloudfront.net/customer_risk_dataset-bd8995d80cf648b1b797318bd0b802a3.csv'
df = pd.read_csv(filename)
df.head()

   Occupation Marital_Status Education_Level Account_Type
0   Scientist        Married    Postgraduate      Savings
1    Engineer       Divorced    Postgraduate      Current
2   Scientist       Divorced     High School      Savings
3   Scientist         Single    Postgraduate      Current
4  Unemployed       Divorced    Postgraduate      Current

In [89]:
df["Risk_Category"]="Medium"
df[(df["Occupation"] == "Unemployed") & (df["Education_Level"] == "High School"), "Risk_Category"]="High"
df[df["Occupation"].isin(["Engineer", "Doctor", "Scientist", "Lawyer"]) & (df["Education_Level"] == "Postgraduate") & (df["Account_Type"] == "Fixed Deposit") & (df["Marital_Status"] == "Married"), "Risk_Category"] = "Low"

["High" if df["Occupation"]=="Unemployed" and df["Education_Level"]=="High School",
                             "Low" if df["Occupation"] in ['Engineer', 'Doctor', 'Scientist', 'Lawyer'] 
                     and df["Education_Level"]=='Postgraduate' and 
                     df['Account_Type']=='Fixed Deposit' and d
                     f['Marital_Status']=='Married',
                            else "Medium" ]

SyntaxError: expected 'else' after 'if' expression (392925958.py, line 1)